Revit 2017 API
Panel Methods
The Panel type exposes the following members.
Methods
Name | Description
AddCoping
Adds a coping (cut) to a steel beam.
 (Inherited from FamilyInstance.)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
Dispose |  (Inherited from Element.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindHostPanel
 Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
flipFacing
The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
 (Inherited from FamilyInstance.)
FlipFromToRoom
 Flips the settings of "From Room" and "To Room" for the door or window instance.
 (Inherited from FamilyInstance.)
flipHand
The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
 (Inherited from FamilyInstance.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetCopingIds
Lists the elements currently used as coping cutters for this element.
 (Inherited from FamilyInstance.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetFamilyPointPlacementReferences
Returns the Point Placement References for the Family Instance.
 (Inherited from FamilyInstance.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetOriginalGeometry
 Returns the original geometry of the instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
 (Inherited from FamilyInstance.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetRefGridLines
 This method is used to get the reference gridlines.
GetSpatialElementCalculationPoint
Gets the location of the calculation point for this instance.
 (Inherited from FamilyInstance.)
GetSpatialElementFromToCalculationPoints
Gets the locations for the calculation points for this instance.
 (Inherited from FamilyInstance.)
GetSubComponentIds
Gets the sub component ElementIds of the current family instance.
 (Inherited from FamilyInstance.)
GetSweptProfile
Gets the object that describes the profile that is swept along the driving curve for this instance.
 (Inherited from FamilyInstance.)
GetTotalTransform
 Gets the total transform, which includes the true north transform for instances like import instances.
 (Inherited from Instance.)
GetTransform
 Gets the transform of the instance.
 (Inherited from Instance.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasModifiedGeometry
Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
 (Inherited from FamilyInstance.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasSweptProfile
Indicates if this instance can be represented as a swept profile.
 (Inherited from FamilyInstance.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
RemoveCoping
Removes a coping (cut) from a steel beam.
 (Inherited from FamilyInstance.)
rotate
The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
 (Inherited from FamilyInstance.)
SetCopingIds
Specifies the set of coping cutters on this element.
 (Inherited from FamilyInstance.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
Split
Splits the family instance element at a point on its defining curve.
 (Inherited from FamilyInstance.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Panel Class
Autodesk.Revit.DB Namespace